# language: ru
Функционал: Перевод между своими счетами

  Сценарий: Успешный перевод
    Дано пользователь открыл форму перевода
    Когда пользователь выбирает счёт списания «Текущий счёт»
    И пользователь выбирает счёт зачисления «Накопительный счёт»
    И вводит сумму 500
    И нажимает кнопку «Перевести»
    Тогда на экране отображается сообщение «Перевод выполнен»

  Сценарий: Недостаточно средств
    Дано пользователь открыл форму перевода
    Когда пользователь выбирает счёт списания «Текущий счёт»
    И пользователь выбирает счёт зачисления «Накопительный счёт»
    И вводит сумму 20000
    И нажимает кнопку «Перевести»
    Тогда на экране отображается сообщение «Недостаточно средств»

  Сценарий: Перевод с нулевой суммой
    Дано пользователь открыл форму перевода
    Когда пользователь выбирает счёт списания «Текущий счёт»
    И пользователь выбирает счёт зачисления «Накопительный счёт»
    И вводит сумму 0
    И нажимает кнопку «Перевести»
    Тогда на экране отображается сообщение «Введите сумму больше нуля»
